#+title: Troubleshoot vCluster / apisnoop
#+CREATOR: ii.nz
#+PROPERTY: header-args:shell :exports both
#+PROPERTY: header-args:shell+ :async true
#+PROPERTY: header-args:shell+ :eval no-export
#+PROPERTY: header-args:shell+ :var KUBECONFIG=(concat (getenv "HOME") "/.kube/config-cloudnative.nz")
#+PROPERTY: header-args:shell+ :var VCKUBECONFIG=(concat (getenv "HOME") "/.kube/config-" (getenv "USER") "-cloudnative.nz.conf")
#+PROPERTY: header-args:shell+ :var NAMESPACE=(getenv "USER")
#+PROPERTY: header-args:shell+ :prologue "exec 2>&1\nexport KUBECONFIG VCKUBECONFIG"
#+PROPERTY: header-args:shell+ :epilogue ":\n"
#+PROPERTY: header-args:tmux :session ":default"

* Confirm remote cluster

#+begin_src shell :exports both
kubectl get nodes -owide
#+end_src

#+RESULTS:
#+begin_example
NAME   STATUS   ROLES           AGE   VERSION   INTERNAL-IP       EXTERNAL-IP   OS-IMAGE             KERNEL-VERSION      CONTAINER-RUNTIME
srv1   Ready    control-plane   23d   v1.27.3   123.253.178.101   <none>        Ubuntu 22.04.2 LTS   5.15.0-76-generic   containerd://1.6.21
#+end_example

